Конфигурация/InformationRegisters/СтатистикаРаботыВнутреннихМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаРаботыВнутреннихМеханизмов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачалоМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончаниеМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СессияЗавершенаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Механизм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаВыполнения</Name>
					<Comment>Должна соответствовать дате из ПериодВыполненияНачало. Служит для групповой обработки записей</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатистикаРаботыВнутреннихМеханизмов/Ext/ManagerModule.bsl
Функция ПолучитьПараметрыВыполнения(Объект, СвойстваОбъекта = Неопределено, ДополнительныеСвойства = Неопределено) Экспорт
	
	Если СвойстваОбъекта = Неопределено Тогда
		
		ПараметрыОтчета = Новый Структура;
		
		Если ТипЗнч(Объект) = Тип("Структура") Тогда
			Для Каждого Элемент Из Объект Цикл
				ПараметрыОтчета.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;
		Иначе
			Для Каждого МетаРеквизит Из Объект.Метаданные().Реквизиты Цикл
				ПараметрыОтчета.Вставить(МетаРеквизит.Имя, Объект[МетаРеквизит.Имя]);
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
		ПараметрыОтчета = Новый Структура(СвойстваОбъекта);
		ЗаполнитьЗначенияСвойств(ПараметрыОтчета, Объект);
		
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеСвойства) = Тип("Структура") Тогда
		Для Каждого Свойство Из ДополнительныеСвойства Цикл
			ПараметрыОтчета.Вставить(Свойство.Ключ, Свойство.Значение);
		КонецЦикла;
	КонецЕсли;
	
	МассивОписаний = Новый Массив;
	Для Каждого ПараметрОтчета Из ПараметрыОтчета Цикл
		МассивОписаний.Добавить(ПараметрОтчета.Ключ + ": " + ПараметрОтчета.Значение);
	КонецЦикла;
	Описание = СтрСоединить(МассивОписаний, Символы.ПС);
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание",
		Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9)),
		Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции

Процедура ДополнитьПараметрыВыполненияСессии(Знач Механизм, Сессия, ДополнительныеПараметры, ИсключениеПриОтсутствииСессии = Ложь, Запись = Неопределено) Экспорт

	ОбновитьЗаписьВБазеДанных = (Запись = Неопределено);
	
	Если ОбновитьЗаписьВБазеДанных Тогда
		
		Запись = ПолучитьЗаписьСтатистики(Механизм, Сессия, ИсключениеПриОтсутствииСессии);
		Если Не Запись.Выбран() Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Количество() > 0 Тогда
		
		ПараметрыВыполнения = Запись.ПараметрыВыполнения.Получить();
		
		Если ПараметрыВыполнения = Неопределено Тогда
			ПараметрыВыполнения = Новый Структура;
		КонецЕсли;
		
		ОписаниеДополнительныхПараметров = Новый Массив;

		Для Каждого Параметр Из ДополнительныеПараметры Цикл
			
			Если Параметр.Ключ = "ТекстОшибки" Тогда
				
				Запись.СессияЗавершенаСОшибкой = Истина;
				
				ТекстыОшибок = Неопределено;
				Если Не ПараметрыВыполнения.Свойство("ТекстОшибки", ТекстыОшибок) Тогда
					ТекстыОшибок = Новый Массив;
					ПараметрыВыполнения.Вставить("ТекстОшибки", ТекстыОшибок);
				ИначеЕсли ТипЗнч(ТекстыОшибок) <> Тип("Массив") Тогда
					СтарыйТекст = ТекстыОшибок;
					ТекстыОшибок = Новый Массив;
					ТекстыОшибок.Добавить(СтарыйТекст);
					ПараметрыВыполнения.Вставить("ТекстОшибки", ТекстыОшибок);
				КонецЕсли;
				
				ТекстыОшибок.Добавить(Параметр.Значение);
				
			Иначе
				ПараметрыВыполнения.Вставить(Параметр.Ключ, Параметр.Значение);
			КонецЕсли;
			
			ОписаниеДополнительныхПараметров.Добавить(Параметр.Ключ + ": " + Параметр.Значение);
			
		КонецЦикла;
		
		Запись.ПараметрыВыполнения = Новый ХранилищеЗначения(ПараметрыВыполнения, Новый СжатиеДанных(9));
		ОписаниеПараметров = СтрСоединить(ОписаниеДополнительныхПараметров, Символы.ПС);
		
	ИначеЕсли ТипЗнч(ДополнительныеПараметры) = Тип("Строка") Тогда
		
		ОписаниеПараметров = ДополнительныеПараметры;
		
	Иначе
		
		ОписаниеПараметров = "";
		ОбновитьЗаписьВБазеДанных = Ложь;
		
	КонецЕсли;
	
	Запись.Описание = Запись.Описание + ?(ПустаяСтрока(Запись.Описание), "", ?(ПустаяСтрока(ОписаниеПараметров), "", Символы.ПС)) + ОписаниеПараметров;
	
	Если ОбновитьЗаписьВБазеДанных Тогда
		Запись.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполнения = Неопределено, Описание = "") Экспорт
	
	Сессия = Новый УникальныйИдентификатор;
	
	Запись = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.СоздатьМенеджерЗаписи();
	Запись.Механизм               	= Механизм;
	Запись.Сессия                 	= Сессия;
	Запись.ПериодВыполненияНачало 	= ТекущаяДата();
	Запись.ПериодВыполненияНачалоМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Запись.ПараметрыВыполнения    	= ПараметрыВыполнения;
	Запись.Ответственный          	= РаботаСПользователями.ТекущийПользователь();
	Запись.Описание               	= Описание;
	Запись.Сеанс					= НомерСеансаИнформационнойБазы();
	Запись.ДатаНачалаВыполнения     = НачалоДня(Запись.ПериодВыполненияНачало);
	
	ФоновоеЗадание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	Если ФоновоеЗадание <> Неопределено Тогда
		Запись.Описание = Запись.Описание + Символы.ПС + "Фоновое задание: " + ФоновоеЗадание.Наименование;
	КонецЕсли; 
	
	Запись.Записать();
	
	Возврат Сессия;
	
КонецФункции

Процедура ЗарегистрироватьОкончаниеСессии(Механизм, Сессия, ИсключениеПриОтсутствииСессии = Ложь, ДопПараметры = Неопределено, ТекстОшибки = Неопределено) Экспорт
	
	Запись = ПолучитьЗаписьСтатистики(Механизм, Сессия, ИсключениеПриОтсутствииСессии);
	Если Не Запись.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры <> Неопределено Тогда
		ДополнитьПараметрыВыполненияСессии(,, ДопПараметры,, Запись);
	КонецЕсли;
	
	Если ТипЗнч(ТекстОшибки) = Тип("Строка") И Не ПустаяСтрока(ТекстОшибки) Тогда
		
		Запись.СессияЗавершенаСОшибкой = Истина;
		Запись.Описание = Запись.Описание + Символы.ПС + "Текст ошибки: " + ТекстОшибки;
		
	КонецЕсли;
	
	Запись.ПериодВыполненияОкончание   = ТекущаяДата();
	Запись.ПериодВыполненияОкончаниеМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Запись.Записать();
	
КонецПроцедуры

// Регистрирует сессию компоновки СКД
//
// Параметры:
//   ОтчетОбъект - ОтчетОбъект, ВнешнийОтчет - отчет, формируемый при помощи СКД
//   Механизм - Строка - Инициатор сессии
//						Если не указан, заполняется полным именем отчета
//
Функция ЗарегистрироватьНовуюСессиюКомпоновкиСКД(ОтчетОбъект, Механизм = Неопределено) Экспорт
	
	Если Механизм = Неопределено Тогда
		Механизм = ОтчетОбъект.Метаданные().ПолноеИмя();
	КонецЕсли;
	
	ПараметрыВыполнения	= Новый Соответствие;
	Описание			= "";
	НастройкиКомпоновки	= ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	Для Каждого ПараметрДанных Из НастройкиКомпоновки.ПараметрыДанных.Элементы Цикл
		Если ПараметрДанных.Использование Тогда
			ПараметрыВыполнения.Вставить(Строка(ПараметрДанных.Параметр), ПараметрДанных.Значение);
			Описание = Описание + Строка(ПараметрДанных.Параметр) + ": " + ПараметрДанных.Значение + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		СформироватьОписаниеЭлементаОтбора(Описание, ЭлементОтбора, ПараметрыВыполнения);
	КонецЦикла;
	
	Попытка
		// на случай вызова метода не из внешнего отчета
		Версия = ОтчетОбъект.СведенияОВнешнейОбработке().Версия;
		ПараметрыВыполнения.Вставить("Версия", Версия);
		Описание = Описание + "Версия: " + Версия + Символы.ПС;
	Исключение
		// ничего не делаем
	КонецПопытки; 
	
	Сессия = ЗарегистрироватьНовуюСессию(Механизм, Новый ХранилищеЗначения(ПараметрыВыполнения, Новый СжатиеДанных(9)), Лев(Описание, СтрДлина(Описание) - 1));  	
	
	Возврат Сессия;
	
КонецФункции

Функция ЗарегистрироватьНовуюСессиюОбъекта(Объект, ТочкаВызова, ДопПараметры = Неопределено) Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(Объект,, ДопПараметры);
	
	Механизм = Объект.Метаданные().ПолноеИмя() + "." + ТочкаВызова;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	Возврат
		Новый Структура("Механизм, Сессия", Механизм, Сессия);

КонецФункции 

// Регистрирует завершение сессии компоновки СКД
//
// Параметры:
//   ОтчетОбъект - ОтчетОбъект, ВнешнийОтчет - отчет, формируемый при помощи СКД
//   Сессия - УникальныйИдентификатор - ID сессии сбора статистики
//   Механизм - Строка - Инициатор сессии
//						Если не указан, заполняется полным именем отчета
//   ИсключениеПриОтсутствииСессии - Булево - Вызывать исключение при отсутствии сессии сбора статистики
//
Процедура ЗарегистрироватьОкончаниеСессииКомпоновкиСКД(ОтчетОбъект, Сессия, Механизм = Неопределено, ИсключениеПриОтсутствииСессии = Ложь) Экспорт

	Если Механизм = Неопределено Тогда
		Механизм = ОтчетОбъект.Метаданные().ПолноеИмя();
	КонецЕсли;
	
	ЗарегистрироватьОкончаниеСессии(Механизм, Сессия, ИсключениеПриОтсутствииСессии);

КонецПроцедуры

#Область ВСПОМОГАТЕЛЬНЫЕ_ФУНКЦИИ

Функция ПолучитьЗаписьСтатистики(Знач Механизм, Сессия, ИсключениеПриОтсутствииСессии)
	
	Запись = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.СоздатьМенеджерЗаписи();
	
	// #ТехДолг: перенести в МетаданныеПовтИсп
	Механизм = Лев(Механизм, Метаданные.РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.Измерения.Механизм.Тип.КвалификаторыСтроки.Длина);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатистикаРаботыВнутреннихМеханизмов.Механизм КАК Механизм,
		|	СтатистикаРаботыВнутреннихМеханизмов.Сессия КАК Сессия,
		|	СтатистикаРаботыВнутреннихМеханизмов.ДатаНачалаВыполнения КАК ДатаНачалаВыполнения
		|ИЗ
		|	РегистрСведений.СтатистикаРаботыВнутреннихМеханизмов КАК СтатистикаРаботыВнутреннихМеханизмов
		|ГДЕ
		|	СтатистикаРаботыВнутреннихМеханизмов.Механизм = &Механизм
		|	И СтатистикаРаботыВнутреннихМеханизмов.Сессия = &Сессия";
	
	Запрос.УстановитьПараметр("Механизм", Механизм);
	Запрос.УстановитьПараметр("Сессия",   Сессия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Если ИсключениеПриОтсутствииСессии Тогда
			ВызватьИсключение "Отсутствует сессия " + Сессия + " по внутр. механизму " + Механизм;
		Иначе
			Возврат Запись;
		КонецЕсли;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(Запись, Выборка, "Механизм, Сессия, ДатаНачалаВыполнения");
	Запись.Прочитать();
	
	// блокировка в момент чтения не накладывается и, чисто гипотетически, запись можно успеть удалить
	// до того, как она будет прочитана
	Если Не Запись.Выбран() И ИсключениеПриОтсутствииСессии Тогда
		ВызватьИсключение "Не удалось прочитать сессию " + Сессия + "/ " + Выборка.ДатаНачалаВыполнения + " / " + Механизм;
	КонецЕсли;
	
	Возврат Запись;
	
КонецФункции

Процедура СформироватьОписаниеЭлементаОтбора(Описание, ЭлементОтбора, ПараметрыВыполнения, Уровень = 0)
	Если ЭлементОтбора.Использование Тогда
		Отступ = ?(Уровень = 0, "", СтрЗаменить(Формат(0, "ЧЦ=" + Формат(Уровень * 3, "ЧГ=") + "; ЧН=; ЧВН=; ЧГ=") , "0", " "));
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Описание = Описание + Отступ + Строка(ЭлементОтбора.ТипГруппы) + ?(ПустаяСтрока(ЭлементОтбора.Представление), "", " (" + ЭлементОтбора.Представление + ")") + ": " + Символы.ПС;
			Для Каждого ЭлементГруппыОтбора Из ЭлементОтбора.Элементы Цикл
				СформироватьОписаниеЭлементаОтбора(Описание, ЭлементГруппыОтбора, ПараметрыВыполнения, Уровень + 1);
			КонецЦикла;
		Иначе
			ПараметрыВыполнения.Вставить(Строка(ЭлементОтбора.ЛевоеЗначение), ЭлементОтбора.ПравоеЗначение);
			Описание = Описание + Отступ + Строка(ЭлементОтбора.ЛевоеЗначение) + ": " + ЭлементОтбора.ПравоеЗначение + Символы.ПС;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
